server/performance/auth-load-test.yml
config:
  target: 'http://localhost:${PORT:-3001}'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up phase'
    - duration: 120
      arrivalRate: 50
      name: 'Normal load phase'
    - duration: 60
      arrivalRate: 100
      name: 'Peak load phase'
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Health Check'
    flow:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200

  - name: 'User Registration'
    flow:
      - post:
          url: '/api/auth/register'
          json:
            username: "{{ $randomString(8) }}"
            password: "password123"
            nickname: "Test User {{ $randomNumber(1000, 9999) }}"
            email: "test{{ $randomNumber(1000, 9999) }}@example.com"
          expect:
            - statusCode: 201

  - name: 'User Login'
    flow:
      - post:
          url: '/api/auth/login'
          json:
            username: "testuser"
            password: "password123"
          expect:
            - statusCode: 200

  - name: 'Get Game Status'
    flow:
      - get:
          url: '/api/game/status'
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: 'Get Leaderboard'
    flow:
      - get:
          url: '/api/game/leaderboard'
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200